{
  "remedies": [
    {
      "id": 20,
      "symptom": "general wellness",
      "title": "apothecary just over",
      "description": "Slowly getting there started this journey 4 years ago the goal is to be come self sufficient.. Instagram @mccorganic.",
      "videoURL": "remedy_20.mp4",
      "source": "reddit",
      "upvotes": 1658,
      "dateAdded": "2025-09-16T16:42:54.723133",
      "approved": true,
      "featured": true
    },
    {
      "id": 21,
      "symptom": "perimenopause",
      "title": "herbs",
      "description": "After blood work my doctor confirmed I’m in perimenopause and all hormones are low across the board. I’m experiencing night sweats, non-existent libido, vaginal dryness, weight gain… I really don’t want to start synthetic hormones. Please advise… especially about the “dryness” 😔.",
      "videoURL": "remedy_21.mp4",
      "source": "reddit",
      "upvotes": 1309,
      "dateAdded": "2025-09-16T16:42:54.723183",
      "approved": true,
      "featured": true
    },
    {
      "id": 22,
      "symptom": "headache",
      "title": "made aspirin and",
      "description": "As the title said after finding out Aspirin originally was made from plants, I decided to make my own. So I got my hand on some White Willow Bark and made a simple 50% alcohol tincture. After successfully testing it a couple of times on regular \"looked-at-screens-for-too-long\" headaches, I'm absolutely BAFFLED. How is it possible that making such a useful tincture is so simple and cheap? Why don't we teach this stuff in schools?? I spent like 4USD on ingredients and made enough tincture for a...",
      "videoURL": "remedy_22.mp4",
      "source": "reddit",
      "upvotes": 1031,
      "dateAdded": "2025-09-16T16:42:54.723228",
      "approved": true,
      "featured": true
    },
    {
      "id": 23,
      "symptom": "flu",
      "title": "first feverfew tincture!",
      "description": "See you in 2 months, my sweet! This plant was bought 2 years ago before I had any interest in healing herbs. We let it go to seed and this guy popped up in a crack in the brick walkway this year! My husband suffers with migraines so I actually bought a plant early this spring, knowing I wouldn’t see flowers until next year, so this is quite a welcome surprise!",
      "videoURL": "remedy_23.mp4",
      "source": "reddit",
      "upvotes": 963,
      "dateAdded": "2025-09-16T16:42:54.723261",
      "approved": true,
      "featured": true
    },
    {
      "id": 24,
      "symptom": "general wellness",
      "title": "this blend feels",
      "description": "my own custom blend of mugwort, skullcap, passion flower, lemon balm and chamomile. The relaxing buzz it creates is incredibly enjoyable. My wife and I smoked one of these while walking the dog last night and were both blown away by how strong and pleasant the effects were. surprisingly, the smoke is rather smooth and pleasant as well. looking forward to our evening walk in a few hours to share one again.",
      "videoURL": "remedy_24.mp4",
      "source": "reddit",
      "upvotes": 913,
      "dateAdded": "2025-09-16T16:42:54.723315",
      "approved": true,
      "featured": true
    },
    {
      "id": 25,
      "symptom": "general wellness",
      "title": "mullein",
      "description": "now, vs before planted april 27th from lil bbs i found around the front and back yard. as of now, they’re approx 5/6 feet :) eep.",
      "videoURL": "remedy_25.mp4",
      "source": "reddit",
      "upvotes": 902,
      "dateAdded": "2025-09-16T16:42:54.723343",
      "approved": true,
      "featured": true
    },
    {
      "id": 26,
      "symptom": "sleep",
      "title": "herbs",
      "description": "Hi. I’m looking for herbs or herbal gummies I can take to help me sleep that aren’t melatonin, because I know too much of that can cause nightmares. Thank you so much.",
      "videoURL": "remedy_26.mp4",
      "source": "reddit",
      "upvotes": 854,
      "dateAdded": "2025-09-16T16:42:54.723374",
      "approved": true,
      "featured": true
    },
    {
      "id": 27,
      "symptom": "allergies",
      "title": "pseudoscience going kill",
      "description": "I have been a member of the subreddit for a while now. Usually I see decent posts about to use herbal remedies for minor aliments which could easily work. Usually people are supportive and helpful but I also see somethings that are deeply saddening and just plain wrong. MAINSTREAM MEDICINE IS NOT EVIL AND THE ACTUAL EVIL IS PSEUDOSCIENCE. I've seen posts about herbs curing cancer, how chemo is 'just wrong' and infinite posts about how 'this one random guy on the Internet says it works, so it ...",
      "videoURL": "remedy_27.mp4",
      "source": "reddit",
      "upvotes": 838,
      "dateAdded": "2025-09-16T16:42:54.723517",
      "approved": true,
      "featured": true
    },
    {
      "id": 28,
      "symptom": "general wellness",
      "title": "found patch ghost",
      "description": "Monotropa uniflora, also known as ghost plant, ghost pipe, or Indian pipe, is an herbaceous, parasitic, non-photosynthesizing, perennial flowering plant native to temperate regions The name \"Monotropa\" is Greek for \"one turn\" and \"uniflora\" is Latin for \"one flowered\" as there is one sharply curved stem for each single flower. M.uniflora is commonly found growing in clumps of 2 or more, with its fungal source nearby. Source for above is from wikipedia. I collected about 2/3rds of the flowers ...",
      "videoURL": "remedy_28.mp4",
      "source": "reddit",
      "upvotes": 782,
      "dateAdded": "2025-09-16T16:42:54.723606",
      "approved": true,
      "featured": true
    },
    {
      "id": 29,
      "symptom": "stress",
      "title": "tension shoulders unexpectedly",
      "description": "Or idk could’ve been placebo effect, it’s been a long week.",
      "videoURL": "remedy_29.mp4",
      "source": "reddit",
      "upvotes": 770,
      "dateAdded": "2025-09-16T16:42:54.723711",
      "approved": true,
      "featured": true
    },
    {
      "id": 30,
      "symptom": "health",
      "title": "herbs",
      "description": "My dad gifted me a very old book he kept in his basement. To my surprise, it was filled with insightful knowledge from the past. It lists most diseases, infections, sicknesses and illnesses with a list of herbs to remedy it. I’ve attached some photos, but if you guys have any specific questions I can try to find it in the book and give you guys some answers!",
      "videoURL": "remedy_30.mp4",
      "source": "reddit",
      "upvotes": 689,
      "dateAdded": "2025-09-16T16:42:54.723772",
      "approved": true,
      "featured": true
    },
    {
      "id": 31,
      "symptom": "general wellness",
      "title": "bedroom student herbalist",
      "description": "I've just moved to attend in-person full time herbalism school. My room is set up to help me stay on track with my intention to be a full time herbalist. Under the bed there is a bunch of herbal making supplies.",
      "videoURL": "remedy_31.mp4",
      "source": "reddit",
      "upvotes": 688,
      "dateAdded": "2025-09-16T16:42:54.723824",
      "approved": true,
      "featured": true
    },
    {
      "id": 32,
      "symptom": "stress",
      "title": "just tried lemon",
      "description": "Just tried a lemon balm tincture and I am just blown away at how relaxing and calming this is! I stumbled upon this page and kept seeing lemon balm being mentioned for anxiety, so I picked some up and this honestly is comparable to Xanax/ Klonipin. The lemon balm has helped my throat relax, as I hold tension in there. This lemon balm is going to change my life. I'm really interested in combining lemon balm with other herbs to really pump up the relaxation effects. Does anybody have any favori...",
      "videoURL": "remedy_32.mp4",
      "source": "reddit",
      "upvotes": 685,
      "dateAdded": "2025-09-16T16:42:54.723918",
      "approved": true,
      "featured": true
    },
    {
      "id": 33,
      "symptom": "fatigue",
      "title": "accidently cured period",
      "description": "I started drinking tea when lent started As a way to eliminate bad sugary drink like pop or articifical sweetner drinks. I love loose leaf tea. Anyway early this month before my period i was drinking a tea that was blend with green tea, raspberry, hisbiscus. Well my 1st day of period i always have cramps except this last period no cramps. Just found out raspberry tea eliminates cramps during period well there must of been enough raspberry in my tea to do the job. I just found this out and con...",
      "videoURL": "remedy_33.mp4",
      "source": "reddit",
      "upvotes": 655,
      "dateAdded": "2025-09-16T16:42:54.723998",
      "approved": true,
      "featured": true
    },
    {
      "id": 35,
      "symptom": "general wellness",
      "title": "stinging nettle cake",
      "description": "I was harvesting stinging nettle yesterday to dry and store when I remembered that last summer, my friend’s mom made her a stinging nettle cake for her birthday party. I had to make one and surprise my aunts, uncles, and parents. They hate nettle and avoid it like the plague for obvious reasons, so they were mind blown when I made a delicious cake out of it. 😂 Thought this group might enjoy! Putting recipe in comments….",
      "videoURL": "remedy_35.mp4",
      "source": "reddit",
      "upvotes": 648,
      "dateAdded": "2025-09-16T16:42:54.724191",
      "approved": true,
      "featured": true
    },
    {
      "id": 34,
      "symptom": "general wellness",
      "title": "made first salve!",
      "description": "Lemon balm infused olive oil, local beeswax, vitamin e and lemongrass essential oil. I'm so excited to use my home grown herbs in a way that heals ❤️.",
      "videoURL": "remedy_34.mp4",
      "source": "reddit",
      "upvotes": 643,
      "dateAdded": "2025-09-16T16:42:54.724133",
      "approved": true,
      "featured": true
    },
    {
      "id": 36,
      "symptom": "general wellness",
      "title": "lemon balm harvested",
      "description": "We have so much lemon balm! I harvested about the same amount two weeks ago. Will be drying this for tea.",
      "videoURL": "remedy_36.mp4",
      "source": "reddit",
      "upvotes": 628,
      "dateAdded": "2025-09-16T16:42:54.724239",
      "approved": true,
      "featured": true
    },
    {
      "id": 37,
      "symptom": "stress",
      "title": "blend",
      "description": "I made myself an anxiety/selfcare smoke blend today. You can smoke this as it is or add to tobacco or cannabis. I use mullein for the base and go from there. Recipe: •Mullein (lung base + balance): 4 tbsp •Skullcap (nervous system relaxant): 2tbsp •Rose petals (emotional calm): 1 tbsp •Chamomile (soothes nerves, digestive tension): 1 tbsp •Passionflower (mental calm, sedative):1 tbsp •Lavender (aromatic tension relief): ½ tbsp Cut any big pieces, mix, store in air tight jar. *Smoke in moderat...",
      "videoURL": "remedy_37.mp4",
      "source": "reddit",
      "upvotes": 560,
      "dateAdded": "2025-09-16T16:42:54.724308",
      "approved": true,
      "featured": true
    },
    {
      "id": 38,
      "symptom": "general wellness",
      "title": "did it!!",
      "description": "You guys, I did it!! I made and packaged my first ever tinctures and salves! The first salve is yarrow and the second is an anti-inflammatory blend with herbs I grew, foraged and dried myself! I also made a pine needle basket to put some in for a Christmas gift to a relative!",
      "videoURL": "remedy_38.mp4",
      "source": "reddit",
      "upvotes": 558,
      "dateAdded": "2025-09-16T16:42:54.724345",
      "approved": true,
      "featured": true
    },
    {
      "id": 39,
      "symptom": "stress",
      "title": "magnesium. was really",
      "description": "I will probably post this in other subreddits if that's cool. My goal being to inform as many people who may be struggling like I Am/Was . I am a recovering Alcoholic/Drug Enthusiast. I also have bipolar disorder. My habits started to become less and less ..... fruitful? So that , at first, caused me to quit and start turning towards the \"right way\" to take care of myself. 20mg of Prozac and 50 mg Lamotrigine twice a day for my depression, anxiety, and mood swings. It works. Huge difference h...",
      "videoURL": "remedy_39.mp4",
      "source": "reddit",
      "upvotes": 540,
      "dateAdded": "2025-09-16T16:42:54.724454",
      "approved": true,
      "featured": true
    },
    {
      "id": 46,
      "symptom": "cold",
      "title": "tips",
      "description": "These tips will directly come from my mind and experience. I'm 20M from India and have been sick most my life and on medications until I decided to change me lifestyle. Not on a single med for past 2 years and not planning to in future. 1. Avoid excess sugar, salt &amp; caffeine. See for alternatives like jaggery/honey as sweetner ( stevia not healthy ) / Non iodised salt like rock salt / black salt. Arjun Tea instead of Caffeine or Tanin tea. Alternative method to have Caffeine mentioned in ...",
      "videoURL": "remedy_46.mp4",
      "source": "reddit",
      "upvotes": 99,
      "dateAdded": "2025-09-16T16:42:54.725039",
      "approved": true,
      "featured": true
    },
    {
      "id": 47,
      "symptom": "cold",
      "title": "ancient practice oil",
      "description": "Oil pulling is a simple yet very powerful technique that will result in stronger over-all health and provide an increase of vigor and vitality. It is simply swishing about a tablespoon or so of oil around your mouth, teeth and gums for 15 – 20 minutes ‘pulling’ the oil through the teeth, then spitting the oil out. Practiced since ancient times as a part of Aryuvedic medicine, practitioners believe that oil pulling expels toxins, pathogens and heavy metals from your body, resulting in a strong...",
      "videoURL": "remedy_47.mp4",
      "source": "reddit",
      "upvotes": 85,
      "dateAdded": "2025-09-16T16:42:54.725312",
      "approved": true,
      "featured": true
    },
    {
      "id": 48,
      "symptom": "headache",
      "title": "ayurveda deep dive:",
      "description": "Hey Reddit fam! Ayurveda brought balance and positivity to my life. By following its principles, I learned the importance of a daily routine, natural remedies, and mindful eating. I hope this post helps you to find that balance. I have mindfully created this post with my experience of ayurvedic treatments and working closely with a friend who is an ayurvedic practitioner in UK (took a sample set of the patients): **Most Common Health Problems Tackled** \\- Digestive Issue: 68% of stories menti...",
      "videoURL": "remedy_48.mp4",
      "source": "reddit",
      "upvotes": 68,
      "dateAdded": "2025-09-16T16:42:54.725423",
      "approved": true,
      "featured": true
    },
    {
      "id": 49,
      "symptom": "headache",
      "title": "learned ayurveda and",
      "description": "I just wanted to take a moment to share my experiences with how learning Ayurveda has profoundly changed my life. Two years ago, I was trapped in the chaos of modern living + unhealthy eating, lack of exercise, and chronic stress, which led to numerous health issues. A friend recommended Ayurveda, an ancient holistic Indian medicinal system that not only focuses on physical health but also considers emotional and spiritual well-being. I embarked on this journey with skepticism but soon realiz...",
      "videoURL": "remedy_49.mp4",
      "source": "reddit",
      "upvotes": 67,
      "dateAdded": "2025-09-16T16:42:54.725512",
      "approved": true,
      "featured": true
    },
    {
      "id": 41,
      "symptom": "flu",
      "title": "anybody here chew",
      "description": "I was reading [this super researched article]( last week on mastic gum, and decided to pick up a pack. Been chewing it for a few days now and it's so relaxing. My stomach aches are gone, and I also feel my jaw getting a workout which is an unexpected plus. I was really surprised to read about all the health benefits though. &gt;***Stops Cavities:*** unlike most other gum, mastic gum not only is sugarless but likely even prevents cavities altogether. A [2006 study]( published in the *Archives ...",
      "videoURL": "remedy_41.mp4",
      "source": "reddit",
      "upvotes": 63,
      "dateAdded": "2025-09-16T16:42:54.724633",
      "approved": true,
      "featured": true
    },
    {
      "id": 40,
      "symptom": "general wellness",
      "title": "does anyone regret",
      "description": "*If this post seems inappropriate for your community please feel free to let me know... maybe even redirect me if you don't mind. I am just sincerely wondering, and I find Reddit to be a safe and anonymous place for us to share our true opinions, views and maybe ask things that we normally get shunned for Personally, I took the vaccine 2020 era. I feel like I really had to go against something strong in my self to take an 'alien' vaccine from a stranger. Already I had found it to be strange h...",
      "videoURL": "remedy_40.mp4",
      "source": "reddit",
      "upvotes": 62,
      "dateAdded": "2025-09-16T16:42:54.724544",
      "approved": true,
      "featured": true
    },
    {
      "id": 42,
      "symptom": "general wellness",
      "title": "why does reddit",
      "description": "I browse reddit frequently and almost on a daily basis are posts or comments about how alternative medicine is garbage and should even be banned. These posts/comments get thosands of upvotes. Why are people so opposed to things like chiropractics, acupuncture and homeopathy. I had the chance to try a homeopathic remedy from a naturopath and I was astounded at how well it worked. I couldnt believe it. A problem I had non stop vanished a day after I took it. Sometimes it feels almost like a con...",
      "videoURL": "remedy_42.mp4",
      "source": "reddit",
      "upvotes": 60,
      "dateAdded": "2025-09-16T16:42:54.724715",
      "approved": true,
      "featured": true
    },
    {
      "id": 43,
      "symptom": "stress",
      "title": "took years realize",
      "description": "For the longest time, I thought my exhaustion was just part of being a functioning adult. I’d push through mornings on coffee, blame stress for my brain fog, and tell myself hair loss and dull skin were just “getting older.” Years went by. I tried exercising more, sleeping longer, meditating… nothing made a real dent. Most doctors told me my labs were “fine.” Finally, one ran a full panel - not just the usual basics. That’s when I found out my thyroid was under strain and I was low in vitamin...",
      "videoURL": "remedy_43.mp4",
      "source": "reddit",
      "upvotes": 38,
      "dateAdded": "2025-09-16T16:42:54.724817",
      "approved": true,
      "featured": false
    },
    {
      "id": 44,
      "symptom": "general wellness",
      "title": "when did you",
      "description": "When did you lose trust in traditional medicine? Mine was over a series of events that included big pharma. I’m DONE.",
      "videoURL": "remedy_44.mp4",
      "source": "reddit",
      "upvotes": 33,
      "dateAdded": "2025-09-16T16:42:54.724852",
      "approved": true,
      "featured": false
    },
    {
      "id": 1,
      "symptom": "headache",
      "title": "parasites your belly?",
      "description": "A **Parasite Cleanse** is designed to eliminate parasites from your body. It usually involves dietary adjustments, supplements, and lifestyle changes over a defined period. # What's Typically Involved in a Parasite Cleanse: **1. Herbal Supplements:** * **Black Walnut:** Contains juglone, effective against parasites. * **Wormwood:** Known for expelling intestinal parasites. * **Cloves:** Targets parasite eggs, preventing reinfestation. * **Garlic:** Strong antimicrobial and anti-parasitic effe...",
      "videoURL": "remedy_1.mp4",
      "source": "reddit",
      "upvotes": 22,
      "dateAdded": "2025-09-16T16:42:54.721459",
      "approved": true,
      "featured": false
    },
    {
      "id": 2,
      "symptom": "general wellness",
      "title": "colloidal silver",
      "description": "Making colloidal silver is easy 🙌😉.",
      "videoURL": "remedy_2.mp4",
      "source": "reddit",
      "upvotes": 21,
      "dateAdded": "2025-09-16T16:42:54.721777",
      "approved": true,
      "featured": false
    },
    {
      "id": 3,
      "symptom": "cold",
      "title": "soap",
      "description": "BACKGROUND As a 30 year old Male been living with toenail fungus for 5+ years, started on one nail then spread. Probably cause, like a lot of guys, I went through a period of re-wearing dirty socks and not cleaning feet properly, but soon began with proper sock wearing and cleaning hygiene. RESEARCH / MORE BACKGROUND Doctor said that meds would help but have potential liver damage ( they would have to monitor my liver while I was taking the pills as well as having to stop drinking, which let'...",
      "videoURL": "remedy_3.mp4",
      "source": "reddit",
      "upvotes": 21,
      "dateAdded": "2025-09-16T16:42:54.721887",
      "approved": true,
      "featured": false
    },
    {
      "id": 4,
      "symptom": "stomach ache",
      "title": "put lavendar your",
      "description": "So I heard about being able to put Organic oil in your belly button Different ones for different things. I thought I would give it a shot and holy fuck I am tired as fuck right now. The lavender really works my whole body is relaxed every muscle. I smoke weed but it never gets me this relaxed. I am so impressed and blowed. Neem oil is supposed to help with acne and clear complexion so I’ll be trying this next. And will let you know but I vouch for this lavender shit in your belly button.",
      "videoURL": "remedy_4.mp4",
      "source": "reddit",
      "upvotes": 19,
      "dateAdded": "2025-09-16T16:42:54.721941",
      "approved": true,
      "featured": false
    },
    {
      "id": 5,
      "symptom": "high blood",
      "title": "remedy",
      "description": "If you are looking for any natural health remedies to help lower your blood pressure you should try some hibiscus tea, my mother struggles with constant high blood pressure and it helps lower it quite a bit, and it’s a win win because it’s natural, tastes great, and will help manage high blood pressure. I’ll leave a link to the one my mother buys if interested! Articles:.",
      "videoURL": "remedy_5.mp4",
      "source": "reddit",
      "upvotes": 18,
      "dateAdded": "2025-09-16T16:42:54.722022",
      "approved": true,
      "featured": false
    },
    {
      "id": 6,
      "symptom": "general wellness",
      "title": "adhd awareness!!!",
      "description": "Kids don’t need pills 🙌 they need parents to do research 🧐.",
      "videoURL": "remedy_6.mp4",
      "source": "reddit",
      "upvotes": 18,
      "dateAdded": "2025-09-16T16:42:54.722069",
      "approved": true,
      "featured": false
    },
    {
      "id": 7,
      "symptom": "general wellness",
      "title": "how remove moles",
      "description": "I have had a mole on my back since I was young, I wanted to go to doctor to get it removed. I am a person that uses natural remedies for illnesses and so forth. What I tried and it worked, is to put vinegar on a cotton ball,Soak a cotton ball in apple cider vinegar and secure it to the mole with a bandage for a few hours daily. Keep repeating everyday and the mole will dry up, and fall off. It took about 7 days for mine to dry up and fall off.",
      "videoURL": "remedy_7.mp4",
      "source": "reddit",
      "upvotes": 18,
      "dateAdded": "2025-09-16T16:42:54.722125",
      "approved": true,
      "featured": false
    },
    {
      "id": 8,
      "symptom": "cough",
      "title": "cloves",
      "description": "Cloves originate from a clove tree and serve as a popular spice. Their primary application lies in tea and mulled drinks, as well as being an ingredient in gingerbread. Moreover, cloves possess remarkable properties as an antifungal and antiviral agent. Consequently, they are utilized for remedying various health issues, including toothaches, coughs, sore gums, indigestion, asthma, mouth ulcers, and stress. Cloves possess a potent anesthetic compound called eugenol, which also acts as an anti...",
      "videoURL": "remedy_8.mp4",
      "source": "reddit",
      "upvotes": 16,
      "dateAdded": "2025-09-16T16:42:54.722214",
      "approved": true,
      "featured": false
    },
    {
      "id": 9,
      "symptom": "cough",
      "title": "sliced onions socks?!",
      "description": "My toddler has been coughing for a week because of a pneumonia infection, and i couldn't bare to see another night where she coughs every 15 minutes during her sleep. I had heard a natural \"Dr\" from Australia saying you'll be amazed by the result of putting sliced onion in their socks at night. Welllllllll its NOT a coincidence that 15 minutes after doing it, she has been sleeping like a baby, its been hours!!! Tell me why do you think this works ????? I just can't understand the mechanism ar...",
      "videoURL": "remedy_9.mp4",
      "source": "reddit",
      "upvotes": 16,
      "dateAdded": "2025-09-16T16:42:54.722243",
      "approved": true,
      "featured": false
    },
    {
      "id": 10,
      "symptom": "flu",
      "title": "daily healing plan",
      "description": "Hi everyone I just wanted to share my daily healing plan which I started a few months ago with vagal breathing, and to which I've been adding as I go along and discover other healing methods. My plan is as follows: * Practice gratitude while smiling for at least 2-3 minutes, at least twice per day. * Talk lovingly to my body for at least 2-3 minutes at least twice per day. * Vocal toning for at least 3 minutes, at least twice per day. * Vagal breathing for at least 20 minutes once daily. * Me...",
      "videoURL": "remedy_10.mp4",
      "source": "reddit",
      "upvotes": 14,
      "dateAdded": "2025-09-16T16:42:54.722288",
      "approved": true,
      "featured": false
    },
    {
      "id": 11,
      "symptom": "cancer",
      "title": "tea",
      "description": "I heard good reviews that the leaves helps with cancer. I'm wondering if anyone took this tea or knows anyone who has. How long does it take to see results, and was this combined with any other herbs not chemotherapy though but maybe a cleanse and change of diet?",
      "videoURL": "remedy_11.mp4",
      "source": "reddit",
      "upvotes": 13,
      "dateAdded": "2025-09-16T16:42:54.722328",
      "approved": true,
      "featured": false
    },
    {
      "id": 12,
      "symptom": "herpes",
      "title": "colloidal silver herpes",
      "description": "Hi there - I have suffered with G. Herpes for about 10 years now. As of the last 2 years I use colloidal silver 10ppm on the outbreak as soon as I feel it coming on. It has dramatically reduced my outbreaks from 7-10 days down to 3-5. Which is huge when its....ya know, down there. I have read that there is a possibly to \"kill\" the virus and heal herpes totally by ingesting CS multiple times a day for about 3 months. Has anyone tried this? Any recommendations? I'm at my wits end with this! I w...",
      "videoURL": "remedy_12.mp4",
      "source": "reddit",
      "upvotes": 13,
      "dateAdded": "2025-09-16T16:42:54.722389",
      "approved": true,
      "featured": false
    },
    {
      "id": 13,
      "symptom": "headache",
      "title": "your mind",
      "description": "Hi everyone I just wanted to share a few *mind over matter* methods I use to help relive pain. I hope they will help some of you. There are a few methods I have used over time and as I got better, the methods worked better and faster. Here they are in order: 1. The first method I used was something I learned from a book. It said you can make negative feelings such as anxiety, anger, fear etc go away quickly simply by allowing their intensity to grow and and trying to feel or imagine that inte...",
      "videoURL": "remedy_13.mp4",
      "source": "reddit",
      "upvotes": 11,
      "dateAdded": "2025-09-16T16:42:54.722489",
      "approved": true,
      "featured": false
    },
    {
      "id": 14,
      "symptom": "cold",
      "title": "how get rid",
      "description": "I recently had toe fungus and wanted to share how I got rid of it. First thing is to wear socks less often. My feet get cold very often and because of that I was constantly wearing socks. This is a big no no as fungus likes to grow where areas are moist. Following that, I soaked my feet every night in warm water with tea tree salt. This made my fungus disappear. I didn't want to go straight to antibiotics so I tried this first and it really does work. Not sure if this helps anyone but I didn’...",
      "videoURL": "remedy_14.mp4",
      "source": "reddit",
      "upvotes": 11,
      "dateAdded": "2025-09-16T16:42:54.722520",
      "approved": true,
      "featured": false
    },
    {
      "id": 15,
      "symptom": "cough",
      "title": "remedies",
      "description": "Dry cough is a common condition that can be caused by a variety of factors such as viral infections, allergies, smoking, and environmental irritants. While there are numerous over-the-counter medications available to treat dry cough, many people prefer to use natural remedies to alleviate their symptoms. Take a look at these home remedies for dry cough: · **Honey:** Honey is a natural cough suppressant that can help soothe the throat and reduce coughing. You can take a spoonful of honey direc...",
      "videoURL": "remedy_15.mp4",
      "source": "reddit",
      "upvotes": 11,
      "dateAdded": "2025-09-16T16:42:54.722609",
      "approved": true,
      "featured": false
    },
    {
      "id": 17,
      "symptom": "general wellness",
      "title": "powerful herbs that",
      "description": "Blood plays an important role in regulating the body’s systems and maintaining homeostasis. Blood has no substitutes, only blood can substitute blood. Blood is composed of plasma, red blood cells, white blood cells and platelets. Blood is a crucial transporter of nutrients and oxygen to various parts of our body and is responsible for making each organ function accurately. Blood cannot function on its own, it rather regulates the channel of transportation, which means even if the blood has de...",
      "videoURL": "remedy_17.mp4",
      "source": "reddit",
      "upvotes": 11,
      "dateAdded": "2025-09-16T16:42:54.722966",
      "approved": true,
      "featured": false
    },
    {
      "id": 16,
      "symptom": "stomach ache",
      "title": "amazing treatment different",
      "description": "**the** [belly button]( **is the most important part of the body. Behind the belly button, there is a PECHOTI, which build more than 72 thousand veins. These veins connected to different parts of the body. A total number of blood veins in our body is the twice of the circumference of the earth. People suffer in many problems due to the dryness of these veins. The belly button is a healing area through this can be cured many problems. here is the link of the article:** [.",
      "videoURL": "remedy_16.mp4",
      "source": "reddit",
      "upvotes": 10,
      "dateAdded": "2025-09-16T16:42:54.722692",
      "approved": true,
      "featured": false
    },
    {
      "id": 18,
      "symptom": "gum disease",
      "title": "remedies",
      "description": "Hey yall, first time posting here, I was wondering if some of the natural girlies could help me out. Just got back from the dentist after a long period without. Turns out…. Pardon my French…. My gums are fucked. They want me to get these special retainers to help repair. However the cost of these retainers, plus all the other work is gonna be just a little over 7k and yall… I dont have it. So im turning to the earth for help. Anything thing that I can get my hands on that will help will be gr...",
      "videoURL": "remedy_18.mp4",
      "source": "reddit",
      "upvotes": 8,
      "dateAdded": "2025-09-16T16:42:54.723043",
      "approved": true,
      "featured": false
    },
    {
      "id": 19,
      "symptom": "general wellness",
      "title": "anyone using castor",
      "description": "I started using Castor Oil to help my eyebrows grow back, now I use it on my face. It’s supposed to be less pore clogging than coconut oil. Is there something I need to do or add to it? I really like it.",
      "videoURL": "remedy_19.mp4",
      "source": "reddit",
      "upvotes": 8,
      "dateAdded": "2025-09-16T16:42:54.723092",
      "approved": true,
      "featured": false
    }
  ],
  "metadata": {
    "version": "1.0",
    "lastUpdated": "2025-09-16T16:42:54.725946",
    "totalRemedies": 48,
    "source": "Reddit r/Home_Remedy"
  }
}