{
  "data": {
    "children": [
      {
        "data": {
          "title": "Natural remedy for persistent headaches - what works for you?",
          "selftext": "I've been dealing with tension headaches and found that peppermint oil on temples really helps. Also drinking ginger tea twice daily. Anyone else have success with natural remedies?",
          "ups": 127,
          "num_comments": 43,
          "url": "https://www.reddit.com/r/Home_Remedy/comments/example1"
        }
      },
      {
        "data": {
          "title": "VIDEO: How to make honey-lemon-ginger tea for sore throat",
          "selftext": "",
          "ups": 89,
          "num_comments": 15,
          "url": "https://youtube.com/watch?v=example"
        }
      },
      {
        "data": {
          "title": "Turmeric paste for joint pain - my grandmother's recipe",
          "selftext": "Mix turmeric with coconut oil and black pepper. Apply to affected area. The anti-inflammatory properties are amazing!",
          "ups": 234,
          "num_comments": 67
        }
      },
      {
        "data": {
          "title": "Apple cider vinegar for acid reflux - does it actually work?",
          "selftext": "I've been taking 1 tbsp diluted in water before meals. Mixed results so far. What's your experience?",
          "ups": 45,
          "num_comments": 89
        }
      },
      {
        "data": {
          "title": "Chamomile compress for eye strain from screens",
          "selftext": "Steep chamomile tea bags, let cool, place on eyes for 10 minutes. Works wonders for computer eye strain!",
          "ups": 178,
          "num_comments": 23
        }
      },
      {
        "data": {
          "title": "VIDEO Tutorial: Eucalyptus steam inhalation for congestion",
          "selftext": "",
          "ups": 156,
          "num_comments": 31,
          "url": "https://vimeo.com/example"
        }
      },
      {
        "data": {
          "title": "Aloe vera gel for sunburn relief - fresh vs store bought?",
          "selftext": "I grow my own aloe and the fresh gel is SO much better than store bought. The cooling effect is immediate.",
          "ups": 203,
          "num_comments": 45
        }
      },
      {
        "data": {
          "title": "Saltwater gargle for sore throat - add honey?",
          "selftext": "Been gargling with warm salt water 3x daily for my sore throat. Someone suggested adding honey. Safe to do?",
          "ups": 67,
          "num_comments": 28
        }
      },
      {
        "data": {
          "title": "Lavender oil for anxiety and better sleep",
          "selftext": "I put a few drops on my pillow every night. Also use a diffuser. My sleep quality has improved dramatically!",
          "ups": 298,
          "num_comments": 76
        }
      },
      {
        "data": {
          "title": "Baking soda paste for insect bites - instant relief!",
          "selftext": "Mix baking soda with a little water to make a paste. Apply to mosquito bites. The itching stops immediately!",
          "ups": 145,
          "num_comments": 19
        }
      },
      {
        "data": {
          "title": "Green tea compress for puffy eyes",
          "selftext": "The caffeine in green tea helps reduce puffiness. I use cooled tea bags every morning.",
          "ups": 91,
          "num_comments": 12
        }
      },
      {
        "data": {
          "title": "VIDEO: Yoga poses for back pain relief",
          "selftext": "",
          "ups": 267,
          "num_comments": 54,
          "url": "https://youtube.com/watch?v=example2"
        }
      },
      {
        "data": {
          "title": "Coconut oil pulling for oral health",
          "selftext": "Swish coconut oil in mouth for 10-15 minutes daily. My gums are healthier and teeth whiter!",
          "ups": 112,
          "num_comments": 93
        }
      },
      {
        "data": {
          "title": "Oatmeal bath for eczema relief",
          "selftext": "Grind plain oatmeal into powder, add to warm bath. Soothes itchy, inflamed skin naturally.",
          "ups": 176,
          "num_comments": 38
        }
      },
      {
        "data": {
          "title": "Cranberry juice for UTI prevention - myth or fact?",
          "selftext": "My doctor says the evidence is mixed, but I swear by unsweetened cranberry juice. What's your take?",
          "ups": 88,
          "num_comments": 105
        }
      },
      {
        "data": {
          "title": "Elderberry syrup for cold and flu symptoms",
          "selftext": "Made my first batch of homemade elderberry syrup. Taking 1 tbsp daily as prevention during flu season.",
          "ups": 195,
          "num_comments": 41
        }
      },
      {
        "data": {
          "title": "Witch hazel for hemorrhoids - surprisingly effective",
          "selftext": "Apply witch hazel on cotton pad to affected area. The relief is almost instant. Natural astringent properties.",
          "ups": 73,
          "num_comments": 16
        }
      },
      {
        "data": {
          "title": "VIDEO: Acupressure points for nausea relief",
          "selftext": "",
          "ups": 142,
          "num_comments": 29,
          "url": "https://youtube.com/watch?v=example3"
        }
      },
      {
        "data": {
          "title": "Epsom salt soak for muscle soreness",
          "selftext": "After workouts, I soak in Epsom salt bath for 20 minutes. The magnesium really helps with recovery.",
          "ups": 224,
          "num_comments": 47
        }
      },
      {
        "data": {
          "title": "Garlic for immune system boost during cold season",
          "selftext": "I eat 2 raw garlic cloves daily when I feel a cold coming. Usually stops it in its tracks!",
          "ups": 96,
          "num_comments": 72
        }
      }
    ]
  }
}